'''
1. 두 수 뽑아서 더하기
 - 정수 리스트가 주어질 때, 리스트 안의 서로 다른 두 수를 뽑아서 더한 후 오름차순으로 반환하기
 ex) Input : [1, 2, 3, 1]
     Output : [2, 3, 4, 5]
 - 반복문, list 활용
 - 난이도 하

2. 삼진법 뒤집기
 - 정수가 주어질 때, 삼진법으로 변환 후 뒤집어서 다시 십진법으로 반환하기
 ex) Input : 45    [1200(3)]
     Output : 7    [0021(3)]
 - while문, list 활용
 - 난이도 하

3. 연속된 숫자 제거하기
 - 한자리 정수의 리스트가 주어질 때, 연속된 숫자가 있을 경우 하나만 남기고 제거하여 반환하기
 ex) Input : [1, 1, 2, 3, 3, 2]
     Output : [1, 2, 3, 2]
 - 반복문, if문 활용
 - 난이도 하

4. 가위바위보 게임
 - 사용자에게 '가위', '바위', '보' 중 하나를 입력받고 컴퓨터도 셋 중 하나를 선택하여 '승리', '패배', '무승부'의 결과가 나오는 프로그램 만들기
 - random한 결과가 나와야 함
 - random, if문 활용
 - 난이도 중

5. 정렬 알고리즘
 - Selection Sort, Insertion Sort, Bubble Sort의 알고리즘을 직접 짜보기
 - for문 활용, list 정렬
 - 난이도 중
 '''